---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForSegmentsEnabled
source: html/f8d57ff5-95ad-1d65-edb9-73607167f668.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.BendDiameterDimensionsForSegmentsEnabled Property

Identifies if radial or diameter dimensions will be shown for the bends between segments.
 Radial or diameter dimesions for arc segments will be shown by default.
 This property has a menaning only if BendDiameterDimensionsEnabled is set to true.

## Syntax (C#)
```csharp
public bool BendDiameterDimensionsForSegmentsEnabled { get; set; }
```